Repository: Y-Baker/.NET_InnoTech
Catalog: StudentAffairs/Resources/Resource.*.resx
Languages: ar, de

source: Age
ar: العمر
de: Alter

# ArUSur
source: Are you sure ?
ar: هل أنت متأكد؟
de: Sind Sie sicher?

source: Cancel
ar: إلغاء
de: Abbrechen

source: Course View
ar: عرض المقررات
de: Kursansicht

source: Credit Hours
ar: الساعات المعتمده
de: Kreditstunden

source: Delete
ar: حذف
de: Löschen

source: Doctor
ar: الدكتور
de: Doktor

source: Doctor View
ar: عرض الدكاتره
de: Doktoransicht

source: Email
ar: الايميل

source: GPA
ar: المعدل التراكمي
de: Notendurchschnitt

source: Instructor
ar: الدكتور
de: Dozent

source: Major
ar: التخصص
de: Hauptfach

source: Mobile
ar: رقم الهاتف
de: Handy

source: Name
ar: الاسم

source: None
ar: لا يوجد
de: Keine

source: Operations
ar: العمليات
de: Operationen

source: Pre-Request
ar: المتطلبات
de: Voranfrage

source: Registered Doctors
ar: الدكاتره المسجلين
de: Eingetragene Ärzte

source: Registered Students
ar: الطلاب المسجلين
de: Eingetragene Studenten

source: Reset
ar: إعادة تعيين
de: Zurücksetzen

# SelectInstructor
source: Select an instructor
ar: اختر الدكتور
de: Wählen Sie einen Dozenten

source: Student View
ar: عرض الطلاب
de: Studentenansicht

source: Submit
ar: تسجيل
de: Absenden

source: Total Students
ar: إجمالي الطلاب
de: Gesamtzahl der Studenten

# V-AgeEmpty
source: Age can't be empty
ar: لا يمكن أن يكون العمر فارغًا
de: Alter darf nicht leer sein

# V-AgeLarge
source: Age can't be larger than {ComparisonValue}
ar: {ComparisonValue} لا يمكن أن يكون العمر أكبر من
de: Alter darf nicht größer als {ComparisonValue} sein

# V-AgeLess
source: Age can't be less than {ComparisonValue}
ar: {ComparisonValue} لا يمكن أن يكون العمر أقل من
de: Alter darf nicht kleiner als {ComparisonValue} sein

# V-CreditHoursEmpty
source: Credit Hours can't be empty
ar: لا يمكن أن تكون الساعات المعتمدة فارغة
de: Kreditstunden dürfen nicht leer sein

# V-CreditHoursLarge
source: Credit Hours can't be larger than {ComparisonValue}
ar: لا يمكن أن تكون الساعات المعتمدة أكبر من {ComparisonValue}
de: Kreditstunden dürfen nicht größer als {ComparisonValue} sein

# V-CreditHoursNegative
source: Credit Hours can't be negative
ar: لا يمكن أن تكون الساعات المعتمدة قيمه سالبه
de: Kreditstunden dürfen nicht negativ sein

# V-EmailEmpty
source: Email can't be empty
ar: لا يمكن أن يكون البريد الإلكتروني فارغًا
de: E-Mail darf nicht leer sein

# V-EmailValid
source: {PropertyValue} is not a valid email address
ar: {PropertyValue} ليس عنوان بريد إلكتروني صالح
de: {PropertyValue} ist keine gültige E-Mail-Adresse

# V-GPAEmpyt
source: GPA can't be empty
ar: لا يمكن أن يكون المعدل التراكمي فارغًا
de: Notendurchschnitt darf nicht leer sein

# V-GPALarge
source: GPA can't be larger than {ComparisonValue}
ar: لا يمكن أن يكون المعدل التراكمي أكبر من {ComparisonValue}
de: Notendurchschnitt darf nicht größer als {ComparisonValue} sein

# V-GPANegative
source: GPA can't be negative
ar: لا يمكن أن يكون المعدل التراكمي سلبياً
de: Notendurchschnitt darf nicht negativ sein

# V-Instructor
source: Instructor must be selected
ar: يجب اختيار دكتور للمقرر
de: Dozent muss ausgewählt werden

# V-MajorEmpty
source: Major can't be empty
ar: لا يمكن أن يكون التخصص فارغًا
de: Hauptfach darf nicht leer sein

# V-MajorLength
source: Major Length({TotalLength}) must be between 2 and 150
ar: يجب أن يتراوح طول التخصص ({TotalLength}) بين 2 و150
de: Die Länge des Hauptfachs ({TotalLength}) muss zwischen 2 und 150 liegen

# V-MobileEmpty
source: Mobile can't be empty
ar: لا يمكن أن يكون رقم الهاتف فارغًا
de: Handy darf nicht leer sein

# V-MobileValid
source: Mobile use invalid characters
ar: يستخدم رقم الهاتف أحرفًا غير صالحة
de: Handy enthält ungültige Zeichen

# V-NameEmpty
source: Name can't be empty
ar: لا يمكن أن يكون الاسم فارغًا
de: Name darf nicht leer sein

# V-NameLength
source: Name Length({TotalLength}) must be between 3 and 50
ar: يجب أن يتراوح طول الاسم ({TotalLength}) بين 3 و50
de: Die Länge des Namens ({TotalLength}) muss zwischen 3 und 50 liegen

# V-PreRequest
source: PreRequest must be a valid course or set to None.
ar: يجب أن تكون المتطلبات مقرر صالحة أو لا يوجد
de: Voranfrage muss ein gültiger Kurs sein oder auf "Keine" gesetzt werden

source: Academic Year
ar: السنة الدراسيه
de: Akademisches Jahr

source: Contact Us
ar: اتصل بنا
de: Kontaktieren Sie uns

source: Events & Activities
ar: الفعاليات والأنشطة
de: Veranstaltungen & Aktivitäten

source: Home
ar: الصفحه الرئيسية
de: Startseite

source: Log In
ar: تسجيل الدخول
de: Anmelden

# P-Course
source: Enter course name
ar: أدخل اسم المقرر
de: Geben Sie den Kursnamen ein

# P-Email
source: Enter your email
ar: أدخل بريدك الإلكتروني
de: Geben Sie Ihre E-Mail-Adresse ein

# P-Major
source: Enter your major
ar: أدخل تخصصك
de: Geben Sie Ihr Hauptfach ein

# P-Mobile
source: Enter your mobile
ar: أدخل رقم هاتفك المحمول
de: Geben Sie Ihre Handynummer ein

# P-Name
source: Enter your name
ar: أدخل اسمك
de: Geben Sie Ihren Namen ein

# P-Survey
source: Anything you like to mention...
ar: أي شيء تريد ذكره...
de: Möchten Sie noch etwas erwähnen...

# Rate
source: Rate your satisfaction (1 to 10)
ar: قيم مدى رضاك (1 إلى 10)
de: Bewerten Sie Ihre Zufriedenheit (1 bis 10)

source: Register
ar: انشاء حساب
de: Registrieren

source: Semester
ar: الفصل الدراسي

source: Student Services
ar: خدمات الطلاب
de: Studentendienste

source: Survey
ar: استبيان
de: Umfrage

# Survey-Content
source: How the course content is up-to-date?
ar: ما مدى تحديث محتوى المقرر؟
de: Wie aktuell ist der Kursinhalt?

# Survey-Expectation
source: How the course live up to your expectations?
ar: ما مدى تحقيق المقرر لتوقعاتك؟
de: Hat der Kurs Ihre Erwartungen erfüllt?

# Survey-Instructor
source: How was the Instructor?
ar: كيف كان الدكتور؟
de: Wie war der Dozent?

# Survey-Lap
source: How was the Lap?
ar: كيف كان المعمل؟
de: Wie war das Labor?

# Survey-Others
source: Other comments
ar: اي تعليقات أخرى
de: Weitere Kommentare

# Survey-Overall
source: Overall Experience:
ar: التجربة العامة:
de: Gesamterlebnis:

# SurveyTitle
source: Your feedback helps us improve.
ar: ملاحظاتك تساعدنا في تحسين الخدمة.
de: Ihr Feedback hilft uns, uns zu verbessern.

source: Academic Email
ar: الايميل الجامعي
de: Akademische E-Mail

source: Course Results
ar: نتائج المقررات
de: Kurs Ergebnisse

source: Courses
ar: المقررات الدراسية
de: Kurse

source: Doctors
ar: الدكاتره
de: Dozenten

# Home-SubTitle
source: Your hub for all student services, events, and materials
ar: مركزك لجميع الخدمات الطلابية، الفعاليات، والمواد
de: Ihr Zentrum für alle studentischen Dienstleistungen, Veranstaltungen und Materialien

# Home-Title
source: Welcome to the Student Affairs System
ar: مرحبًا بكم في نظام شؤون الطلاب
de: Willkommen im Studentenangelegenheiten-System

source: Medical Services
ar: الخدمات الطبية
de: Medizinische Dienste

# Military
source: Military Certification
ar: التدريب العسكري
de: Militärbescheinigung

source: Registration Report
ar: استمارة التسجيل
de: Anmeldebericht

# Schedule
source: School Schedule
ar: جدول المحاضرات
de: Schulplan

source: Select Course
ar: اختر المقرر الدراسي
de: Kurs auswählen

source: Select Semester
ar: اختر الفصل الدراسي
de: Semester auswählen

# SelectYear
source: Select Academic Year
ar: اختر السنة الأكاديمية
de: Akademisches Jahr auswählen

source: Student Affairs
ar: شؤون الطلاب
de: Studentenangelegenheiten

source: Students
ar: الطلاب
de: Studenten

# V-Course
source: Course must be selected
ar: يجب اختيار المقرر الدراسي
de: Ein Kurs muss ausgewählt werden

# V-EmailExists
source: The email ({PropertyValue}) has been registered
ar: تم تسجيل هذا البريد الإلكتروني من قبل
de: Die E-Mail ({PropertyValue}) ist bereits registriert

# V-Semester
source: Semester must be selected
ar: يجب اختيار الفصل الدراسي
de: Ein Semester muss ausgewählt werden

# V-YearEmpty
source: Academic Year must be selected
ar: يجب اختيار السنة الأكاديمية
de: Ein akademisches Jahr muss ausgewählt werden
